# ************************************************************
# Sequel Pro SQL dump
# Version 4541
#
# http://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# Host: 139.217.110.84 (MySQL 5.7.29)
# Database: tianhao
# Generation Time: 2020-09-01 03:51:22 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Dump of table dark_buddy_dark_spy_words
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_dark_spy_words`;

CREATE TABLE `dark_buddy_dark_spy_words` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `word_1` varchar(32) NOT NULL DEFAULT '' COMMENT '词1',
  `word_2` varchar(32) NOT NULL DEFAULT '' COMMENT '词2',
  `status` int(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `dark_buddy_dark_spy_words` WRITE;
/*!40000 ALTER TABLE `dark_buddy_dark_spy_words` DISABLE KEYS */;

INSERT INTO `dark_buddy_dark_spy_words` (`id`, `word_1`, `word_2`, `status`)
VALUES
	(1,'包青天','狄仁杰',0),
	(2,'薰衣草','满天星',0),
	(3,'甄子丹','李连杰',0),
	(4,'男朋友','前男友',0),
	(5,'菠萝蜜','榴莲',0),
	(6,'孟非','乐嘉',0),
	(7,'麦克风','扩音器',0),
	(8,'双胞胎','龙凤胎',0),
	(9,'鼠目寸光','井底之蛙',0),
	(10,'口香糖','木糖醇',0),
	(11,'辣椒','芥末',0),
	(12,'富二代','高富帅',0),
	(13,'唇膏','口红',0),
	(14,'晨光','真彩',0),
	(15,'大白兔','金丝猴',0),
	(16,'那英','韩红',0),
	(17,'谢娜张杰','邓超孙俪',0),
	(18,'面包','蛋糕',0),
	(19,'婚纱','喜服',0),
	(20,'鱼香肉丝','四喜丸子',0),
	(21,'生活费','零花钱',0),
	(22,'纸巾','手帕',0),
	(23,'白菜','生菜',0),
	(24,'洗衣粉','皂角粉',0),
	(25,'甄?传','红楼梦',0),
	(26,'小沈阳','宋小宝',0),
	(27,'董永','许仙',0),
	(28,'新年','跨年',0),
	(29,'贵妃醉酒','黛玉葬花',0),
	(30,'果粒橙','鲜橙多',0),
	(31,'手机','座机',0),
	(32,'丑小鸭','灰姑娘',0),
	(33,'蜘蛛侠','蝙蝠侠',0),
	(34,'赵敏','黄蓉',0),
	(35,'橙子','橘子',0),
	(36,'魔术师','魔法师',0),
	(37,'海豚','海狮',0),
	(38,'十面埋伏','四面楚歌',0),
	(39,'吉他','琵琶',0),
	(40,'金庸','古龙',0),
	(41,'作文','论文',0),
	(42,'语无伦次','词不达意',0),
	(43,'剩女','御姐',0),
	(44,'豆浆','牛奶',0),
	(45,'森马','以纯',0),
	(46,'玫瑰','月季',0),
	(47,'同学','同桌',0),
	(48,'结婚','订婚',0),
	(49,'气泡','水泡',0),
	(50,'动物','植物',0),
	(51,'情人节','光棍节',0),
	(52,'张韶涵','王心凌',0),
	(53,'泡泡糖','棒棒糖',0),
	(54,'饼干','薯片',0),
	(55,'玻璃','镜子',0),
	(56,'风扇','空调',0),
	(57,'电脑','ipad',0),
	(58,'自行车','电动车',0),
	(59,'班主任','辅导员',0),
	(60,'小品','话剧',0),
	(61,'鸭舌帽','遮阳帽',0),
	(62,'童话','神话',0),
	(63,'刘诗诗','刘亦菲',0),
	(64,'奖牌','金牌',0),
	(65,'橙子','橘子',0),
	(66,'铁观音','碧螺春',0),
	(67,'过山车','碰碰车',0),
	(68,'若曦','晴川',0),
	(69,'唇膏','口红',0),
	(70,'壁纸','贴画',0),
	(71,'纸巾','湿巾',0),
	(72,'水盆','水桶',0),
	(73,'小笼包','灌汤包',0),
	(74,'杭州','苏州',0),
	(75,'老佛爷','老天爷',0),
	(76,'首尔','东京',0),
	(77,'胡子','眉毛',0),
	(78,'流星花园','花样男子',0),
	(79,'太监','人妖',0),
	(80,'蝴蝶','蜜蜂',0),
	(81,'图书馆','图书店',0),
	(82,'牛肉干','猪肉脯',0),
	(83,'勇往直前','全力以赴',0),
	(84,'葡萄','提子',0),
	(85,'油条','麻花',0),
	(86,'香港','台湾',0),
	(87,'洗发露','护发素',0),
	(88,'沐浴露','沐浴盐',0),
	(89,'枕头','抱枕',0),
	(90,'郭德纲','周立波',0),
	(91,'作家','编剧',0),
	(92,'壁纸','贴画',0),
	(93,'丑小鸭','灰姑娘',0),
	(94,'天天向上','非诚勿扰',0),
	(95,'酸菜鱼','水煮鱼',0),
	(96,'被子','床单',0),
	(97,'裸婚','闪婚',0),
	(98,'烤肉','涮肉',0),
	(99,'公交','地铁',0),
	(100,'包子','饺子',0),
	(101,'土豆粉','酸辣粉',0),
	(102,'福尔摩斯','工藤新一',0),
	(103,'谢娜','李湘',0),
	(104,'美人心计','倾世皇妃',0),
	(105,'神雕侠侣','天龙八部',0),
	(106,'孟飞','乐嘉',0),
	(107,'近视眼镜','隐形眼镜',0),
	(108,'保安','保镖',0),
	(109,'警察','捕快',0),
	(110,'成吉思汗','努尔哈赤',0),
	(111,'牛奶','豆浆',0),
	(112,'白菜','生菜',0),
	(113,'皇帝','太子',0),
	(114,'饺子','包子',0),
	(115,'降龙十八掌','九阴白骨爪',0),
	(116,'绿茶','苦茶',0),
	(117,'蝴蝶','飞蛾',0),
	(118,'梁山伯与祝英台','罗密欧与朱丽叶',0),
	(119,'辣椒','芥末',0),
	(120,'红烧牛肉面','香辣牛肉面',0),
	(121,'盒子','箱子',0),
	(122,'近视眼镜','隐形眼镜',0),
	(123,'公交','地铁',0),
	(124,'过山车','碰碰车',0),
	(125,'蝴蝶','蜜蜂',0),
	(126,'果粒橙','鲜橙多',0),
	(127,'夏家三千金','爱情睡醒了',0),
	(128,'裸婚','闪婚',0),
	(129,'龙凤呈祥','鸳鸯戏水',0),
	(130,'钢笔','中性笔',0),
	(131,'楼梯','电梯',0),
	(132,'反弹琵琶','乱弹棉花',0),
	(133,'两小无猜','青梅竹马',0),
	(134,'妈妈','娘',0),
	(135,'班主任','辅导员',0),
	(136,'高跟鞋','增高鞋',0),
	(137,'鹅毛','鸡毛',0),
	(138,'老佛爷','老天爷',0),
	(139,'何炅','李维嘉',0),
	(140,'吉他','琵琶',0),
	(141,'麻婆豆腐','皮蛋豆腐',0),
	(142,'干洗机','甩干机',0),
	(143,'鸡蛋','鸭蛋',0),
	(144,'金丝猴','大白兔奶糖',0),
	(145,'包青天','狄仁杰',0),
	(146,'结婚','订婚',0),
	(147,'脚踏车','自行车',0),
	(148,'贵妃醉酒','黛玉葬花',0),
	(149,'江南style','最炫民族风',0),
	(150,'郭德纲','周立波',0),
	(151,'江南style','最炫民族风',0),
	(152,'宫锁心玉','宫锁珠帘',0),
	(153,'烤肉','涮肉',0),
	(154,'端午节','中秋节',0),
	(155,'奖牌','金牌',0),
	(156,'卷发','直发',0),
	(157,'海豚','海狮',0),
	(158,'福尔摩斯-工藤新一','福尔摩斯-柯南',0),
	(159,'哈密瓜','西瓜',0),
	(160,'冠军','第一',0),
	(161,'饭桶','饭碗',0),
	(162,'降龙十八掌','九阴白骨爪',0),
	(163,'汉堡包','肉夹馍',0),
	(164,'婚纱','喜服',0),
	(165,'脸盆','水桶',0),
	(166,'口香糖','木糖醇',0),
	(167,'天天向上','非诚勿扰',0),
	(168,'老佛爷','老天爷',0),
	(169,'宫锁心玉','宫锁珠帘',0),
	(170,'江南style','最炫民族风',0),
	(171,'郭德纲','周立波',0),
	(172,'麻婆豆腐','皮蛋豆腐',0),
	(173,'口香糖','木糖醇',0),
	(174,'近视眼镜','隐形眼镜',0),
	(175,'脚踏车','自行车',0),
	(176,'梁山伯与祝英台','罗密欧与朱丽叶',0),
	(177,'十面埋伏','四面楚歌',0),
	(178,'谢娜张杰','邓超孙俪',0),
	(179,'龙凤呈祥','鸳鸯戏水',0),
	(180,'鱼香肉丝','四喜丸子',0),
	(181,'美人心计','倾世皇妃',0),
	(182,'贵妃醉酒','黛玉葬花',0),
	(183,'哈密瓜','西瓜',0),
	(184,'何炅','李维嘉',0),
	(185,'流星花园','花样男子',0),
	(186,'降龙十八掌','九阴白骨爪',0),
	(187,'神雕侠侣','天龙八部',0),
	(188,'果粒橙','鲜橙多',0),
	(189,'语无伦次','词不达意',0),
	(190,'成吉思汗','努尔哈赤',0),
	(191,'红烧牛肉面','香辣牛肉面',0),
	(192,'海豚','海狮',0),
	(193,'汉堡包','肉夹馍',0),
	(194,'勇往直前','全力以赴',0),
	(195,'近视眼镜','隐形眼镜',0),
	(196,'金丝猴','大白兔奶糖',0),
	(197,'冠军','第一',0),
	(198,'鼠目寸光','井底之蛙',0),
	(199,'夏家三千金','爱情睡醒了',0),
	(200,'福尔摩斯','工藤新一',0),
	(201,'江南style','最炫民族风',0),
	(202,'降龙十八掌','九阴白骨爪',0),
	(203,'两小无猜','青梅竹马',0),
	(204,'福尔摩斯-工藤新','福尔摩斯-柯南',0),
	(205,'贵妃醉酒','黛玉葬花',0),
	(206,'过山车','碰碰车',0),
	(207,'手机','座机',0),
	(208,'干洗机','甩干机',0),
	(209,'牛奶','豆浆',0),
	(210,'包子','饺子',0),
	(211,'海豚','海狮',0),
	(212,'楼梯','电梯',0),
	(213,'蝴蝶','蜜蜂',0),
	(214,'结婚','订婚',0),
	(215,'过山车','碰碰车',0),
	(216,'钢笔','中性笔',0),
	(217,'纸巾','手帕',0),
	(218,'奖牌','金牌',0),
	(219,'鸡蛋','鸭蛋',0),
	(220,'壁纸','贴画',0),
	(221,'唇膏','口红',0),
	(222,'纸巾','湿巾',0),
	(223,'情人节','光棍节',0),
	(224,'油条','麻花',0),
	(225,'白菜','生菜',0),
	(226,'若曦','晴川',0),
	(227,'大白兔','金丝猴',0),
	(228,'小品','话剧',0),
	(229,'面包','蛋糕',0),
	(230,'小笼包','灌汤包',0),
	(231,'气泡','水泡',0),
	(232,'董永','许仙',0),
	(233,'葡萄','提子',0),
	(234,'电脑','ipad',0),
	(235,'沐浴露','沐浴盐',0),
	(236,'作家','编剧',0),
	(237,'蝴蝶','蜜蜂',0),
	(238,'张韶涵','王心凌',0),
	(239,'生活费','零花钱',0),
	(240,'裸婚','闪婚',0),
	(241,'饼干','薯片',0),
	(242,'杭州','苏州',0),
	(243,'脸盆','水桶',0),
	(244,'甄子丹','李连杰',0),
	(245,'玻璃','镜子',0),
	(246,'孟非','乐嘉',0),
	(247,'保安','保镖',0),
	(248,'婚纱','喜服',0),
	(249,'菠萝蜜','榴莲',0),
	(250,'谢娜','李湘',0),
	(251,'被子','床单',0),
	(252,'富二代','高富帅',0),
	(253,'盒子','箱子',0),
	(254,'图书馆','图书店',0),
	(255,'香港','台湾',0),
	(256,'辣椒','芥末',0),
	(257,'动物','植物',0),
	(258,'土豆粉','酸辣粉',0),
	(259,'新年','跨年',0),
	(260,'壁纸','贴画',0),
	(261,'果粒橙','鲜橙多',0),
	(262,'森马','以纯',0),
	(263,'奖牌','金牌',0),
	(264,'薰衣草','满天星',0),
	(265,'老佛爷','老天爷',0),
	(266,'橙子','橘子',0),
	(267,'金庸','古龙',0),
	(268,'豆浆','牛奶',0),
	(269,'吉他','琵琶',0),
	(270,'白菜','生菜',0),
	(271,'吉他','琵琶',0),
	(272,'饭桶','饭碗',0),
	(273,'辣椒','芥末',0),
	(274,'裸婚','闪婚',0),
	(275,'蝴蝶','飞蛾',0),
	(276,'高跟鞋','增高鞋',0),
	(277,'酸菜鱼','水煮鱼',0),
	(278,'晨光','真彩',0),
	(279,'小沈阳','宋小宝',0),
	(280,'婚纱','喜服',0),
	(281,'班主任','辅导员',0),
	(282,'麦克风','扩音器',0),
	(283,'包青天','狄仁杰',0),
	(284,'公交','地铁',0),
	(285,'铁观音','碧螺春',0),
	(286,'洗发露','护发素',0),
	(287,'绿茶','苦茶',0),
	(288,'反弹琵琶','乱弹棉花',0),
	(289,'甄嬛传','红楼梦',0),
	(290,'班主任','辅导员',0),
	(291,'风扇','空调',0),
	(292,'那英','韩红',0),
	(293,'警察','捕快',0),
	(294,'剩女','御姐',0),
	(295,'丑小鸭','灰姑娘',0),
	(296,'胡子','眉毛',0),
	(297,'饺子','包子',0),
	(298,'妈妈','娘',0),
	(299,'公交','地铁',0),
	(300,'卷发','直发',0),
	(301,'烤肉','涮肉',0),
	(302,'鸭舌帽','遮阳帽',0),
	(303,'男朋友','前男友',0),
	(304,'孟飞','乐嘉',0),
	(305,'枕头','抱枕',0),
	(306,'泡泡糖','棒棒糖',0),
	(307,'洗衣粉','皂角粉',0),
	(308,'童话','神话',0),
	(309,'口香糖','木糖醇',0),
	(310,'魔术师','魔法师',0),
	(311,'端午节','中秋节',0),
	(312,'赵敏','黄蓉',0),
	(313,'包青天','狄仁杰',0),
	(314,'唇膏','口红',0),
	(315,'蜘蛛侠','蝙蝠侠',0),
	(316,'结婚','订婚',0),
	(317,'双胞胎','龙凤胎',0),
	(318,'郭德纲','周立波',0),
	(319,'自行车','电动车',0),
	(320,'丑小鸭','灰姑娘',0),
	(321,'皇帝','太子',0),
	(322,'太监','人妖',0),
	(323,'橙子','橘子',0),
	(324,'鹅毛','鸡毛',0),
	(325,'水盆','水桶',0),
	(326,'烤肉','涮肉',0),
	(327,'作文','论文',0),
	(328,'牛肉干','猪肉脯',0),
	(329,'刘诗诗','刘亦菲',0),
	(330,'玫瑰','月季',0),
	(331,'同学','同桌',0),
	(332,'首尔','东京',0),
	(333,'黑板','',0);

/*!40000 ALTER TABLE `dark_buddy_dark_spy_words` ENABLE KEYS */;
UNLOCK TABLES;


# Dump of table dark_buddy_dark_yellow_page
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_dark_yellow_page`;

CREATE TABLE `dark_buddy_dark_yellow_page` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` varchar(32) NOT NULL DEFAULT '' COMMENT 'userid',
  `user_name` varchar(32) NOT NULL DEFAULT '' COMMENT '名字',
  `status` int(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

# Dump of table dark_buddy_message_record
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_message_record`;

CREATE TABLE `dark_buddy_message_record` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `message` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `create_time` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

# Dump of table dark_buddy_sweet_talk
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_sweet_talk`;

CREATE TABLE `dark_buddy_sweet_talk` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `sweet_talk` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

# Dump of table dark_buddy_user
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_user`;

CREATE TABLE `dark_buddy_user` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `sender_id` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `create_time` datetime NOT NULL,
  `update_time` datetime NOT NULL,
  `banned_time` datetime DEFAULT NULL,
  `status` tinyint(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

# Dump of table dark_buddy_user_status
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_user_status`;

CREATE TABLE `dark_buddy_user_status` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `status_id` int(11) NOT NULL,
  `status_code` varchar(32) NOT NULL DEFAULT '',
  `value` varchar(128) NOT NULL DEFAULT '',
  `create_time` datetime NOT NULL,
  `update_time` datetime NOT NULL,
  `status` tinyint(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

# Dump of table dark_buddy_user_status_property
# ------------------------------------------------------------

DROP TABLE IF EXISTS `dark_buddy_user_status_property`;

CREATE TABLE `dark_buddy_user_status_property` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `code` varchar(32) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `description` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `create_time` datetime DEFAULT NULL,
  `editable` tinyint(2) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

LOCK TABLES `dark_buddy_user_status_property` WRITE;
/*!40000 ALTER TABLE `dark_buddy_user_status_property` DISABLE KEYS */;

INSERT INTO `dark_buddy_user_status_property` (`id`, `name`, `code`, `description`, `create_time`, `editable`)
VALUES
	(1,'星座','xingzuo','你的星座',NULL,0),
	(2,'金币','lucky_point','金币是基本的货币，靠日常任务和兑换获取',NULL,1);

/*!40000 ALTER TABLE `dark_buddy_user_status_property` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
